; domain
; The domain for our sokoban problem is simply named sokoban
(define (domain sokoban)

; Our sokoban domain declares the most basic subset of PDDL, consisting of STRIPS as the only requirements
(:requirements :strips)

; For our predicates, we'll specify the name and number of arguments used for each
(:predicates
	(navigable ?location)		; Is the location navigatble
	(direction ?direct)			; Is the object a direction
	(block-at ?box ?location)	; Is the box at the given location
	(robot-at ?location)		; Is the robot at the given location
	(block ?box)				; Is the given box a block or crate
	(adjacent ?location1 ?location2 ?direct) 	; Are the two locations adjacent
	(empty ?location)			; Is the location empty or avalable
)

; We'll need to be able to move our robot through locations
(:action move
	
	; To start, we need a from and to location need to be specified
	:parameters
		(?from ?to ?dir)

	; Before we effect the current state, we need to make sure
	; that both the first two given parameters are navigable,
	; the we have infact a direction
	; and that given the the direction
	; that our to location is both reachable (adjacent) and currently empty
	:precondition 
		(and 
			(navigable ?from) 
			(navigable ?to) 
			(direction ?dir) 
			(robot-at ?from) 
			(adjacent ?from ?to ?dir) 
			(empty ?to)
		)

	; The effect on the current state of the world is that
	; the location we previosly ocupied will now be vacant with no robot,
	; the robot now at the "to" location so "to" now ocupied
	:effect 
		(and 
			(empty ?from)
			(robot-at ?to) 
			(not (empty ?to))
			(not (robot-at ?from))
		)
)

; To menipulate boxes, we'll need to have an action to push them
(:action push

	; To start, we need locations of the robot, block, destination
	; plus the corisponding location and block object to be specified
	:parameters
		(?robotLocation ?blockLocation ?freeLocation  ?dirr ?activeBlock)

	; Before we effect the current state, we need to make sure
	; that all the first three given parameters are navigable,
	; and that the block can be pushed into an empty location
	; that is adjacent in the proper location
	:precondition 
		(and 
			(navigable ?robotLocation) 
			(navigable ?blockLocation) 
			(navigable ?freeLocation)          
			(direction ?dirr) 
			(block ?activeBlock) 
			(robot-at ?robotLocation)                   
			(block-at ?activeBlock ?blockLocation) 
			(adjacent ?robotLocation ?blockLocation ?dirr)                   
			(adjacent ?blockLocation ?freeLocation ?dirr) 
			(empty ?freeLocation)
		)

	; The effect on the current state of the world is that
	; the location we previosly ocupied will now be vacant with no robot,
	; the location the box previosly ocupied will now be ocupied by the robot,
	; and the free location will now be occupied by the box
	:effect
		(and 
			(robot-at ?blockLocation) 
			(block-at ?activeBlock ?freeLocation) 
			(empty ?robotLocation)       
			(not (robot-at ?robotLocation)) 
			(not (block-at ?activeBlock ?blockLocation)) 
			(not (empty ?freeLocation))
		)
)

; problem
; XXXXXX 
; XA__XX 
; Xrab_X 
; XX___X 
; XXX__X 
; XXXX_X 
; XXXXBX 
; XXXXXX 

; This is an auto generated sokoban problem
(define (problem sokoban_problem )

; The domain for our sokoban problem is simply named sokoban
(:domain sokoban)

; Specify list of objects
(:objects 

; Specify list of directions
up down left right

; Specify list of blocks
a b 

; Specify list of locations
r0-c0 r0-c1 r0-c2 r0-c3 r0-c4 r0-c5 
r1-c0 r1-c1 r1-c2 r1-c3 r1-c4 r1-c5 
r2-c0 r2-c1 r2-c2 r2-c3 r2-c4 r2-c5 
r3-c0 r3-c1 r3-c2 r3-c3 r3-c4 r3-c5 
r4-c0 r4-c1 r4-c2 r4-c3 r4-c4 r4-c5 
r5-c0 r5-c1 r5-c2 r5-c3 r5-c4 r5-c5 
r6-c0 r6-c1 r6-c2 r6-c3 r6-c4 r6-c5 
r7-c0 r7-c1 r7-c2 r7-c3 r7-c4 r7-c5 

)


; Init direction objects
(:init

; Init direction objects
(direction up)
(direction down)
(direction left)
(direction right)

; Init block objects and locations
(block a)
(block-at a r2-c2)
(block b)
(block-at b r2-c3)


; Init robot location
(robot-at r2-c1)

; Init navigable objects
(navigable r1-c1)
(navigable r1-c2)
(navigable r1-c3)
(navigable r2-c1)
(navigable r2-c2)
(navigable r2-c3)
(navigable r2-c4)
(navigable r3-c2)
(navigable r3-c3)
(navigable r3-c4)
(navigable r4-c3)
(navigable r4-c4)
(navigable r5-c4)
(navigable r6-c4)

; Init empty objects
(empty r1-c1)
(empty r1-c2)
(empty r1-c3)
(empty r2-c4)
(empty r3-c2)
(empty r3-c3)
(empty r3-c4)
(empty r4-c3)
(empty r4-c4)
(empty r5-c4)
(empty r6-c4)

; Init adjacent objects
(adjacent r0-c0 r1-c0 down) (adjacent r0-c0 r0-c1 right) 
(adjacent r0-c1 r1-c1 down) (adjacent r0-c1 r0-c0 left) (adjacent r0-c1 r0-c2 right) 
(adjacent r0-c2 r1-c2 down) (adjacent r0-c2 r0-c1 left) (adjacent r0-c2 r0-c3 right) 
(adjacent r0-c3 r1-c3 down) (adjacent r0-c3 r0-c2 left) (adjacent r0-c3 r0-c4 right) 
(adjacent r0-c4 r1-c4 down) (adjacent r0-c4 r0-c3 left) (adjacent r0-c4 r0-c5 right) 
(adjacent r0-c5 r1-c5 down) (adjacent r0-c5 r0-c4 left) 
(adjacent r1-c0 r0-c0 up) (adjacent r1-c0 r2-c0 down) (adjacent r1-c0 r1-c1 right) 
(adjacent r1-c1 r0-c1 up) (adjacent r1-c1 r2-c1 down) (adjacent r1-c1 r1-c0 left) (adjacent r1-c1 r1-c2 right) 
(adjacent r1-c2 r0-c2 up) (adjacent r1-c2 r2-c2 down) (adjacent r1-c2 r1-c1 left) (adjacent r1-c2 r1-c3 right) 
(adjacent r1-c3 r0-c3 up) (adjacent r1-c3 r2-c3 down) (adjacent r1-c3 r1-c2 left) (adjacent r1-c3 r1-c4 right) 
(adjacent r1-c4 r0-c4 up) (adjacent r1-c4 r2-c4 down) (adjacent r1-c4 r1-c3 left) (adjacent r1-c4 r1-c5 right) 
(adjacent r1-c5 r0-c5 up) (adjacent r1-c5 r2-c5 down) (adjacent r1-c5 r1-c4 left) 
(adjacent r2-c0 r1-c0 up) (adjacent r2-c0 r3-c0 down) (adjacent r2-c0 r2-c1 right) 
(adjacent r2-c1 r1-c1 up) (adjacent r2-c1 r3-c1 down) (adjacent r2-c1 r2-c0 left) (adjacent r2-c1 r2-c2 right) 
(adjacent r2-c2 r1-c2 up) (adjacent r2-c2 r3-c2 down) (adjacent r2-c2 r2-c1 left) (adjacent r2-c2 r2-c3 right) 
(adjacent r2-c3 r1-c3 up) (adjacent r2-c3 r3-c3 down) (adjacent r2-c3 r2-c2 left) (adjacent r2-c3 r2-c4 right) 
(adjacent r2-c4 r1-c4 up) (adjacent r2-c4 r3-c4 down) (adjacent r2-c4 r2-c3 left) (adjacent r2-c4 r2-c5 right) 
(adjacent r2-c5 r1-c5 up) (adjacent r2-c5 r3-c5 down) (adjacent r2-c5 r2-c4 left) 
(adjacent r3-c0 r2-c0 up) (adjacent r3-c0 r4-c0 down) (adjacent r3-c0 r3-c1 right) 
(adjacent r3-c1 r2-c1 up) (adjacent r3-c1 r4-c1 down) (adjacent r3-c1 r3-c0 left) (adjacent r3-c1 r3-c2 right) 
(adjacent r3-c2 r2-c2 up) (adjacent r3-c2 r4-c2 down) (adjacent r3-c2 r3-c1 left) (adjacent r3-c2 r3-c3 right) 
(adjacent r3-c3 r2-c3 up) (adjacent r3-c3 r4-c3 down) (adjacent r3-c3 r3-c2 left) (adjacent r3-c3 r3-c4 right) 
(adjacent r3-c4 r2-c4 up) (adjacent r3-c4 r4-c4 down) (adjacent r3-c4 r3-c3 left) (adjacent r3-c4 r3-c5 right) 
(adjacent r3-c5 r2-c5 up) (adjacent r3-c5 r4-c5 down) (adjacent r3-c5 r3-c4 left) 
(adjacent r4-c0 r3-c0 up) (adjacent r4-c0 r5-c0 down) (adjacent r4-c0 r4-c1 right) 
(adjacent r4-c1 r3-c1 up) (adjacent r4-c1 r5-c1 down) (adjacent r4-c1 r4-c0 left) (adjacent r4-c1 r4-c2 right) 
(adjacent r4-c2 r3-c2 up) (adjacent r4-c2 r5-c2 down) (adjacent r4-c2 r4-c1 left) (adjacent r4-c2 r4-c3 right) 
(adjacent r4-c3 r3-c3 up) (adjacent r4-c3 r5-c3 down) (adjacent r4-c3 r4-c2 left) (adjacent r4-c3 r4-c4 right) 
(adjacent r4-c4 r3-c4 up) (adjacent r4-c4 r5-c4 down) (adjacent r4-c4 r4-c3 left) (adjacent r4-c4 r4-c5 right) 
(adjacent r4-c5 r3-c5 up) (adjacent r4-c5 r5-c5 down) (adjacent r4-c5 r4-c4 left) 
(adjacent r5-c0 r4-c0 up) (adjacent r5-c0 r6-c0 down) (adjacent r5-c0 r5-c1 right) 
(adjacent r5-c1 r4-c1 up) (adjacent r5-c1 r6-c1 down) (adjacent r5-c1 r5-c0 left) (adjacent r5-c1 r5-c2 right) 
(adjacent r5-c2 r4-c2 up) (adjacent r5-c2 r6-c2 down) (adjacent r5-c2 r5-c1 left) (adjacent r5-c2 r5-c3 right) 
(adjacent r5-c3 r4-c3 up) (adjacent r5-c3 r6-c3 down) (adjacent r5-c3 r5-c2 left) (adjacent r5-c3 r5-c4 right) 
(adjacent r5-c4 r4-c4 up) (adjacent r5-c4 r6-c4 down) (adjacent r5-c4 r5-c3 left) (adjacent r5-c4 r5-c5 right) 
(adjacent r5-c5 r4-c5 up) (adjacent r5-c5 r6-c5 down) (adjacent r5-c5 r5-c4 left) 
(adjacent r6-c0 r5-c0 up) (adjacent r6-c0 r7-c0 down) (adjacent r6-c0 r6-c1 right) 
(adjacent r6-c1 r5-c1 up) (adjacent r6-c1 r7-c1 down) (adjacent r6-c1 r6-c0 left) (adjacent r6-c1 r6-c2 right) 
(adjacent r6-c2 r5-c2 up) (adjacent r6-c2 r7-c2 down) (adjacent r6-c2 r6-c1 left) (adjacent r6-c2 r6-c3 right) 
(adjacent r6-c3 r5-c3 up) (adjacent r6-c3 r7-c3 down) (adjacent r6-c3 r6-c2 left) (adjacent r6-c3 r6-c4 right) 
(adjacent r6-c4 r5-c4 up) (adjacent r6-c4 r7-c4 down) (adjacent r6-c4 r6-c3 left) (adjacent r6-c4 r6-c5 right) 
(adjacent r6-c5 r5-c5 up) (adjacent r6-c5 r7-c5 down) (adjacent r6-c5 r6-c4 left) 
(adjacent r7-c0 r6-c0 up) (adjacent r7-c0 r7-c1 right) 
(adjacent r7-c1 r6-c1 up) (adjacent r7-c1 r7-c0 left) (adjacent r7-c1 r7-c2 right) 
(adjacent r7-c2 r6-c2 up) (adjacent r7-c2 r7-c1 left) (adjacent r7-c2 r7-c3 right) 
(adjacent r7-c3 r6-c3 up) (adjacent r7-c3 r7-c2 left) (adjacent r7-c3 r7-c4 right) 
(adjacent r7-c4 r6-c4 up) (adjacent r7-c4 r7-c3 left) (adjacent r7-c4 r7-c5 right) 
(adjacent r7-c5 r6-c5 up) (adjacent r7-c5 r7-c4 left) 

; Init Done
)
; Define goal states
(:goal (and (block-at a r1-c1) (block-at b r6-c4)))

; Problem Define Done
)

; plan
1. (move r2-c1 r1-c1 up)
   deleted: (empty r1-c1) (robot-at r2-c1)
   added: (empty r2-c1) (robot-at r1-c1)
   goals met: 0 of 2
2. (move r1-c1 r1-c2 right)
   deleted: (empty r1-c2) (robot-at r1-c1)
   added: (empty r1-c1) (robot-at r1-c2)
   goals met: 0 of 2
3. (move r1-c2 r1-c3 right)
   deleted: (empty r1-c3) (robot-at r1-c2)
   added: (empty r1-c2) (robot-at r1-c3)
   goals met: 0 of 2
4. (push r1-c3 r2-c3 r3-c3 down b)
   deleted: (robot-at r1-c3) (block-at b r2-c3) (empty r3-c3)
   added: (robot-at r2-c3) (block-at b r3-c3) (empty r1-c3)
   goals met: 0 of 2
5. (move r2-c3 r1-c3 up)
   deleted: (empty r1-c3) (robot-at r2-c3)
   added: (empty r2-c3) (robot-at r1-c3)
   goals met: 0 of 2
6. (move r1-c3 r1-c2 left)
   deleted: (empty r1-c2) (robot-at r1-c3)
   added: (empty r1-c3) (robot-at r1-c2)
   goals met: 0 of 2
7. (move r1-c2 r1-c1 left)
   deleted: (empty r1-c1) (robot-at r1-c2)
   added: (empty r1-c2) (robot-at r1-c1)
   goals met: 0 of 2
8. (move r1-c1 r2-c1 down)
   deleted: (empty r2-c1) (robot-at r1-c1)
   added: (empty r1-c1) (robot-at r2-c1)
   goals met: 0 of 2
9. (push r2-c1 r2-c2 r2-c3 right a)
   deleted: (robot-at r2-c1) (block-at a r2-c2) (empty r2-c3)
   added: (robot-at r2-c2) (block-at a r2-c3) (empty r2-c1)
   goals met: 0 of 2
10. (move r2-c2 r3-c2 down)
   deleted: (empty r3-c2) (robot-at r2-c2)
   added: (empty r2-c2) (robot-at r3-c2)
   goals met: 0 of 2
11. (push r3-c2 r3-c3 r3-c4 right b)
   deleted: (robot-at r3-c2) (block-at b r3-c3) (empty r3-c4)
   added: (robot-at r3-c3) (block-at b r3-c4) (empty r3-c2)
   goals met: 0 of 2
12. (move r3-c3 r3-c2 left)
   deleted: (empty r3-c2) (robot-at r3-c3)
   added: (empty r3-c3) (robot-at r3-c2)
   goals met: 0 of 2
13. (move r3-c2 r2-c2 up)
   deleted: (empty r2-c2) (robot-at r3-c2)
   added: (empty r3-c2) (robot-at r2-c2)
   goals met: 0 of 2
14. (move r2-c2 r1-c2 up)
   deleted: (empty r1-c2) (robot-at r2-c2)
   added: (empty r2-c2) (robot-at r1-c2)
   goals met: 0 of 2
15. (move r1-c2 r1-c3 right)
   deleted: (empty r1-c3) (robot-at r1-c2)
   added: (empty r1-c2) (robot-at r1-c3)
   goals met: 0 of 2
16. (push r1-c3 r2-c3 r3-c3 down a)
   deleted: (robot-at r1-c3) (block-at a r2-c3) (empty r3-c3)
   added: (robot-at r2-c3) (block-at a r3-c3) (empty r1-c3)
   goals met: 0 of 2
17. (move r2-c3 r2-c4 right)
   deleted: (empty r2-c4) (robot-at r2-c3)
   added: (empty r2-c3) (robot-at r2-c4)
   goals met: 0 of 2
18. (push r2-c4 r3-c4 r4-c4 down b)
   deleted: (robot-at r2-c4) (block-at b r3-c4) (empty r4-c4)
   added: (robot-at r3-c4) (block-at b r4-c4) (empty r2-c4)
   goals met: 0 of 2
19. (push r3-c4 r4-c4 r5-c4 down b)
   deleted: (robot-at r3-c4) (block-at b r4-c4) (empty r5-c4)
   added: (robot-at r4-c4) (block-at b r5-c4) (empty r3-c4)
   goals met: 0 of 2
20. (move r4-c4 r4-c3 left)
   deleted: (empty r4-c3) (robot-at r4-c4)
   added: (empty r4-c4) (robot-at r4-c3)
   goals met: 0 of 2
21. (push r4-c3 r3-c3 r2-c3 up a)
   deleted: (robot-at r4-c3) (block-at a r3-c3) (empty r2-c3)
   added: (robot-at r3-c3) (block-at a r2-c3) (empty r4-c3)
   goals met: 0 of 2
22. (move r3-c3 r3-c4 right)
   deleted: (empty r3-c4) (robot-at r3-c3)
   added: (empty r3-c3) (robot-at r3-c4)
   goals met: 0 of 2
23. (move r3-c4 r2-c4 up)
   deleted: (empty r2-c4) (robot-at r3-c4)
   added: (empty r3-c4) (robot-at r2-c4)
   goals met: 0 of 2
24. (push r2-c4 r2-c3 r2-c2 left a)
   deleted: (robot-at r2-c4) (block-at a r2-c3) (empty r2-c2)
   added: (robot-at r2-c3) (block-at a r2-c2) (empty r2-c4)
   goals met: 0 of 2
25. (move r2-c3 r3-c3 down)
   deleted: (empty r3-c3) (robot-at r2-c3)
   added: (empty r2-c3) (robot-at r3-c3)
   goals met: 0 of 2
26. (move r3-c3 r3-c2 left)
   deleted: (empty r3-c2) (robot-at r3-c3)
   added: (empty r3-c3) (robot-at r3-c2)
   goals met: 0 of 2
27. (push r3-c2 r2-c2 r1-c2 up a)
   deleted: (robot-at r3-c2) (block-at a r2-c2) (empty r1-c2)
   added: (robot-at r2-c2) (block-at a r1-c2) (empty r3-c2)
   goals met: 0 of 2
28. (move r2-c2 r2-c3 right)
   deleted: (empty r2-c3) (robot-at r2-c2)
   added: (empty r2-c2) (robot-at r2-c3)
   goals met: 0 of 2
29. (move r2-c3 r1-c3 up)
   deleted: (empty r1-c3) (robot-at r2-c3)
   added: (empty r2-c3) (robot-at r1-c3)
   goals met: 0 of 2
30. (push r1-c3 r1-c2 r1-c1 left a)
   deleted: (robot-at r1-c3) (block-at a r1-c2) (empty r1-c1)
   added: (robot-at r1-c2) (block-at a r1-c1) (empty r1-c3)
   goals met: 1 of 2
31. (move r1-c2 r1-c3 right)
   deleted: (empty r1-c3) (robot-at r1-c2)
   added: (empty r1-c2) (robot-at r1-c3)
   goals met: 1 of 2
32. (move r1-c3 r2-c3 down)
   deleted: (empty r2-c3) (robot-at r1-c3)
   added: (empty r1-c3) (robot-at r2-c3)
   goals met: 1 of 2
33. (move r2-c3 r2-c4 right)
   deleted: (empty r2-c4) (robot-at r2-c3)
   added: (empty r2-c3) (robot-at r2-c4)
   goals met: 1 of 2
34. (move r2-c4 r3-c4 down)
   deleted: (empty r3-c4) (robot-at r2-c4)
   added: (empty r2-c4) (robot-at r3-c4)
   goals met: 1 of 2
35. (move r3-c4 r4-c4 down)
   deleted: (empty r4-c4) (robot-at r3-c4)
   added: (empty r3-c4) (robot-at r4-c4)
   goals met: 1 of 2
36. (push r4-c4 r5-c4 r6-c4 down b)
   deleted: (robot-at r4-c4) (block-at b r5-c4) (empty r6-c4)
   added: (robot-at r5-c4) (block-at b r6-c4) (empty r4-c4)
   goals met: 2 of 2
